; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link joint angle)

(:predicates
	(Connected ?j - joint ?l - link) 
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?a - angle ?j - joint)
	(Affected ?j - joint ?l - link ?j1 - joint)
	(Fixed ?l - link)
)

(:action increase_angle
:parameters (?link1 ?link2 - link ?joint - joint ?a1 ?a2 - angle)
:precondition (and 
	(Connected ?joint ?link1)
	(Connected ?joint  ?link2)
	(not (Fixed ?link1))
	(not (= ?link1 ?link2))
	(HasAngle ?a1 ?joint)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?joint)) 
	    (HasAngle ?a2 ?joint)
	    (forall (?js - joint ?a3 ?a4 - angle )
		    (when (and (Affected ?js ?link1 ?joint) (not (= ?js ?joint)) (HasAngle ?a3 ?js) (AngleOrd ?a3 ?a4))
		        (and
			        (not (HasAngle ?a3 ?js))
			        (HasAngle ?a4 ?js)
		        )
		    )
	    )
    )
)


(:action decrease_angle
:parameters (?link1 ?link2 - link ?joint - joint ?a1 ?a2 - angle)
:precondition (and 
	(Connected ?joint ?link1)
	(Connected ?joint  ?link2)
	(not (Fixed ?link1))
	(not (= ?link1 ?link2))
	(HasAngle ?a1 ?joint)
	(AngleOrd ?a2 ?a1)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?joint)) 
	    (HasAngle ?a2 ?joint)
	    (forall (?js - joint ?a3 ?a4 - angle )
		    (when (and (Affected ?js ?link1 ?joint) (not (= ?js ?joint)) (HasAngle ?a3 ?js) (AngleOrd ?a4 ?a3))
		        (and
			        (not (HasAngle ?a3 ?js))
			        (HasAngle ?a4 ?js)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_7)
(:domain joint_bar)
(:objects
    link_ground link1 link2 link3 link4 link5 link6 link7 link8 link9 link10 - link
    joint1 joint2 joint3 joint4 joint5 joint6 joint7 joint8 joint9 joint10 - joint
    angle0 angle90 angle180 angle270 - angle)
(:init
    (AngleOrd angle0 angle90)
    (AngleOrd angle90 angle180)
    (AngleOrd angle180 angle270)
    (AngleOrd angle270 angle0)

    (Affected joint1 link1 joint2)
    (Affected joint1 link2 joint3)
    (Affected joint1 link3 joint4)
    (Affected joint1 link4 joint5)
    (Affected joint1 link5 joint6)
    (Affected joint1 link6 joint7)
    (Affected joint1 link7 joint8)
    (Affected joint1 link8 joint9)
    (Affected joint1 link9 joint10)
    (Affected joint2 link1 joint1)
    (Affected joint2 link2 joint3)
    (Affected joint2 link3 joint4)
    (Affected joint2 link4 joint5)
    (Affected joint2 link5 joint6)
    (Affected joint2 link6 joint7)
    (Affected joint2 link7 joint8)
    (Affected joint2 link8 joint9)
    (Affected joint2 link9 joint10)
    (Affected joint3 link1 joint1)
    (Affected joint3 link2 joint2)
    (Affected joint3 link3 joint4)
    (Affected joint3 link4 joint5)
    (Affected joint3 link5 joint6)
    (Affected joint3 link6 joint7)
    (Affected joint3 link7 joint8)
    (Affected joint3 link8 joint9)
    (Affected joint3 link9 joint10)
    (Affected joint4 link1 joint1)
    (Affected joint4 link2 joint2)
    (Affected joint4 link3 joint3)
    (Affected joint4 link4 joint5)
    (Affected joint4 link5 joint6)
    (Affected joint4 link6 joint7)
    (Affected joint4 link7 joint8)
    (Affected joint4 link8 joint9)
    (Affected joint4 link9 joint10)
    (Affected joint5 link1 joint1)
    (Affected joint5 link2 joint2)
    (Affected joint5 link3 joint3)
    (Affected joint5 link4 joint4)
    (Affected joint5 link5 joint6)
    (Affected joint5 link6 joint7)
    (Affected joint5 link7 joint8)
    (Affected joint5 link8 joint9)
    (Affected joint5 link9 joint10)
    (Affected joint6 link1 joint1)
    (Affected joint6 link2 joint2)
    (Affected joint6 link3 joint3)
    (Affected joint6 link4 joint4)
    (Affected joint6 link5 joint5)
    (Affected joint6 link6 joint7)
    (Affected joint6 link7 joint8)
    (Affected joint6 link8 joint9)
    (Affected joint6 link9 joint10)
    (Affected joint7 link1 joint1)
    (Affected joint7 link2 joint2)
    (Affected joint7 link3 joint3)
    (Affected joint7 link4 joint4)
    (Affected joint7 link5 joint5)
    (Affected joint7 link6 joint6)
    (Affected joint7 link7 joint8)
    (Affected joint7 link8 joint9)
    (Affected joint7 link9 joint10)
    (Affected joint8 link1 joint1)
    (Affected joint8 link2 joint2)
    (Affected joint8 link3 joint3)
    (Affected joint8 link4 joint4)
    (Affected joint8 link5 joint5)
    (Affected joint8 link6 joint6)
    (Affected joint8 link7 joint7)
    (Affected joint8 link8 joint9)
    (Affected joint8 link9 joint10)
    (Affected joint9 link1 joint1)
    (Affected joint9 link2 joint2)
    (Affected joint9 link3 joint3)
    (Affected joint9 link4 joint4)
    (Affected joint9 link5 joint5)
    (Affected joint9 link6 joint6)
    (Affected joint9 link7 joint7)
    (Affected joint9 link8 joint8)
    (Affected joint9 link9 joint10)
    (Affected joint10 link1 joint1)
    (Affected joint10 link2 joint2)
    (Affected joint10 link3 joint3)
    (Affected joint10 link4 joint4)
    (Affected joint10 link5 joint5)
    (Affected joint10 link6 joint6)
    (Affected joint10 link7 joint7)
    (Affected joint10 link8 joint8)
    (Affected joint10 link9 joint9)

    (Connected joint1 link_ground)
    (Connected joint1 link1)
    (Connected joint2 link1)
    (Connected joint2 link2)
    (Connected joint3 link2)
    (Connected joint3 link3)
    (Connected joint4 link3)
    (Connected joint4 link4)
    (Connected joint5 link4)
    (Connected joint5 link5)
    (Connected joint6 link5)
    (Connected joint6 link6)
    (Connected joint7 link6)
    (Connected joint7 link7)
    (Connected joint8 link7)
    (Connected joint8 link8)
    (Connected joint9 link8)
    (Connected joint9 link9)
    (Connected joint10 link9)
    (Connected joint10 link10)

    (Fixed link_ground)

    (HasAngle angle180 joint1)
    (HasAngle angle90 joint2)
    (HasAngle angle90 joint3)
    (HasAngle angle90 joint4)
    (HasAngle angle90 joint5)
    (HasAngle angle270 joint6)
    (HasAngle angle0 joint7)
    (HasAngle angle180 joint8)
    (HasAngle angle270 joint9)
    (HasAngle angle180 joint10)
)
(:goal
(and
    (HasAngle angle0 joint1)
    (HasAngle angle180 joint2)
    (HasAngle angle270 joint3)
    (HasAngle angle180 joint4)
    (HasAngle angle180 joint5)
    (HasAngle angle270 joint6)
    (HasAngle angle180 joint7)
    (HasAngle angle180 joint8)
    (HasAngle angle90 joint9)
    (HasAngle angle0 joint10)
    )
)
)

; plan
1. (increase_angle link9 link10 joint10 angle180 angle270)
   deleted: (hasangle angle180 joint10) (hasangle angle180 joint1) (hasangle angle90 joint2) (hasangle angle90 joint3) (hasangle angle90 joint4) (hasangle angle90 joint5) (hasangle angle270 joint6) (hasangle angle0 joint7) (hasangle angle180 joint8) (hasangle angle270 joint9)
   added: (hasangle angle270 joint10) (hasangle angle270 joint1) (hasangle angle180 joint2) (hasangle angle180 joint3) (hasangle angle180 joint4) (hasangle angle180 joint5) (hasangle angle0 joint6) (hasangle angle90 joint7) (hasangle angle270 joint8) (hasangle angle0 joint9)
   goals met: 3 of 10
2. (increase_angle link9 link8 joint9 angle0 angle90)
   deleted: (hasangle angle0 joint9) (hasangle angle270 joint10)
   added: (hasangle angle90 joint9) (hasangle angle0 joint10)
   goals met: 5 of 10
3. (increase_angle link4 link5 joint5 angle180 angle270)
   deleted: (hasangle angle180 joint5) (hasangle angle270 joint1) (hasangle angle180 joint2) (hasangle angle180 joint3) (hasangle angle180 joint4)
   added: (hasangle angle270 joint5) (hasangle angle0 joint1) (hasangle angle270 joint2) (hasangle angle270 joint3) (hasangle angle270 joint4)
   goals met: 4 of 10
4. (decrease_angle link5 link6 joint6 angle0 angle270)
   deleted: (hasangle angle0 joint6) (hasangle angle0 joint1) (hasangle angle270 joint2) (hasangle angle270 joint3) (hasangle angle270 joint4) (hasangle angle270 joint5)
   added: (hasangle angle270 joint6) (hasangle angle270 joint1) (hasangle angle180 joint2) (hasangle angle180 joint3) (hasangle angle180 joint4) (hasangle angle180 joint5)
   goals met: 6 of 10
5. (decrease_angle link8 link7 joint8 angle270 angle180)
   deleted: (hasangle angle270 joint8) (hasangle angle90 joint9) (hasangle angle0 joint10)
   added: (hasangle angle180 joint8) (hasangle angle0 joint9) (hasangle angle270 joint10)
   goals met: 5 of 10
6. (increase_angle link6 link7 joint7 angle90 angle180)
   deleted: (hasangle angle90 joint7) (hasangle angle270 joint1) (hasangle angle180 joint2) (hasangle angle180 joint3) (hasangle angle180 joint4) (hasangle angle180 joint5) (hasangle angle270 joint6)
   added: (hasangle angle180 joint7) (hasangle angle0 joint1) (hasangle angle270 joint2) (hasangle angle270 joint3) (hasangle angle270 joint4) (hasangle angle270 joint5) (hasangle angle0 joint6)
   goals met: 4 of 10
7. (increase_angle link9 link8 joint9 angle0 angle90)
   deleted: (hasangle angle0 joint9) (hasangle angle270 joint10)
   added: (hasangle angle90 joint9) (hasangle angle0 joint10)
   goals met: 6 of 10
8. (decrease_angle link5 link6 joint6 angle0 angle270)
   deleted: (hasangle angle0 joint6) (hasangle angle0 joint1) (hasangle angle270 joint2) (hasangle angle270 joint3) (hasangle angle270 joint4) (hasangle angle270 joint5)
   added: (hasangle angle270 joint6) (hasangle angle270 joint1) (hasangle angle180 joint2) (hasangle angle180 joint3) (hasangle angle180 joint4) (hasangle angle180 joint5)
   goals met: 8 of 10
9. (decrease_angle link4 link3 joint4 angle180 angle90)
   deleted: (hasangle angle180 joint4) (hasangle angle180 joint5) (hasangle angle270 joint6) (hasangle angle180 joint7) (hasangle angle180 joint8) (hasangle angle90 joint9) (hasangle angle0 joint10)
   added: (hasangle angle90 joint4) (hasangle angle90 joint5) (hasangle angle180 joint6) (hasangle angle90 joint7) (hasangle angle90 joint8) (hasangle angle0 joint9) (hasangle angle270 joint10)
   goals met: 1 of 10
10. (increase_angle link3 link2 joint3 angle180 angle270)
   deleted: (hasangle angle180 joint3) (hasangle angle90 joint4) (hasangle angle90 joint5) (hasangle angle180 joint6) (hasangle angle90 joint7) (hasangle angle90 joint8) (hasangle angle0 joint9) (hasangle angle270 joint10)
   added: (hasangle angle270 joint3) (hasangle angle180 joint4) (hasangle angle180 joint5) (hasangle angle270 joint6) (hasangle angle180 joint7) (hasangle angle180 joint8) (hasangle angle90 joint9) (hasangle angle0 joint10)
   goals met: 9 of 10
11. (increase_angle link1 link_ground joint1 angle270 angle0)
   deleted: (hasangle angle270 joint1) (hasangle angle180 joint2) (hasangle angle270 joint3) (hasangle angle180 joint4) (hasangle angle180 joint5) (hasangle angle270 joint6) (hasangle angle180 joint7) (hasangle angle180 joint8) (hasangle angle90 joint9) (hasangle angle0 joint10)
   added: (hasangle angle0 joint1) (hasangle angle270 joint2) (hasangle angle0 joint3) (hasangle angle270 joint4) (hasangle angle270 joint5) (hasangle angle0 joint6) (hasangle angle270 joint7) (hasangle angle270 joint8) (hasangle angle180 joint9) (hasangle angle90 joint10)
   goals met: 1 of 10
12. (decrease_angle link2 link1 joint2 angle270 angle180)
   deleted: (hasangle angle270 joint2) (hasangle angle0 joint3) (hasangle angle270 joint4) (hasangle angle270 joint5) (hasangle angle0 joint6) (hasangle angle270 joint7) (hasangle angle270 joint8) (hasangle angle180 joint9) (hasangle angle90 joint10)
   added: (hasangle angle180 joint2) (hasangle angle270 joint3) (hasangle angle180 joint4) (hasangle angle180 joint5) (hasangle angle270 joint6) (hasangle angle180 joint7) (hasangle angle180 joint8) (hasangle angle90 joint9) (hasangle angle0 joint10)
   goals met: 10 of 10
